{
  "repository": {
    "name": "cdt-express-notebooks",
    "description": "Collection of CDT Express Notebooks",
    "notes": [
      "Some notebooks utilize paginated API endpoints to handle large datasets efficiently. For instance, when retrieving assets associated with a company, the API may return results in pages, each containing up to 100 assets. The total number of credits consumed depends on the total number of assets (N).",
      "\nExample Calculation for a company with 1,500 assets:",
      "* Company Search or Get Call: 1 credit",
      "* Asset Retrieval Credits: 1,500 credits",
      "* __Total Credits Used__: 1 + 1,500 = 1,501 credits",
      "\nIn addition, when performing aggregations, the number of credits consumed will depend on the number of unique groups returned. For example, if you aggregate assets climate scores by country, the number of credits consumed will equal the number of countries returned.",
      "\nExample Calculation for aggregation by country with 10 unique countries:",
      "* Company Search or Get Call: 1 credit",
      "* Country Aggregation Credits: 10 credits",
      "* __Total Credits Used__: 1 + 10 = 11 credits"
    ]
  },
  "notebooks": [
    {
      "id": "0",
      "title": "Demo of inspecting sdk objects in an IDE",
      "filename": "0.sdk-object-exploration-ide-demo.ipynb",
      "description": "Walk through on how to inspect the SDK objects in an IDE. View available methods, their docstrings, and source code.",
      "api_credits": 0
    },
    {
      "id": "1",
      "title": "Company Assets Physical Risks",
      "filename": "1.company-assets-physical-risks.ipynb",
      "description": "Analyze a company's global asset exposure to physical climate risks using the VELO SDK, highlighting risk distribution through maps, sorted treemaps of high-risk regions, and comparative bar charts, enabling stakeholders to prioritize mitigation efforts for assets in vulnerable geographies.",
      "api_credits": 26
    },
    {
      "id": "2",
      "title": "Company Asset Type Risk Across Years",
      "filename": "2.company-asset-type-risk-across-years.ipynb",
      "description": "Retrieve and visualize a company's climate metric scores for two specific asset types for two horizons. Use histograms to compare the distribution of exposures by asset type and line charts to illustrate how average exposures change over time.",
      "api_credits": 1177
    },
    {
      "id": "3",
      "title": "Assets Overlaid Map",
      "filename": "3.assets-overlaid-map.ipynb",
      "description": "Retrieve a company's asset-level climate metric scores, plot their locations, and colour code based on which climate risks are present.",
      "api_credits": 573
    },
    {
      "id": "4",
      "title": "Market Benchmark",
      "filename": "4.market-benchmark.ipynb",
      "description": "Compare a company against a market index to benchmark its exposure to climate risk over time. Visualize the most impactful risk factors for each entity to see which risk factors make up that exposure.",
      "api_credits": 8067
    },
    {
      "id": "5",
      "title": "Insurability",
      "filename": "5.insurability.ipynb",
      "description": "Visualize the change in uninsurable and stranded assets for a company over time due to changes in climate risk exposure. Retrieve and display the most at-risk assets that are uninsurable or stranded.",
      "api_credits": 492
    },
    {
      "id": "6",
      "title": "Company Asset Type Materiality vs. Risk",
      "filename": "6.company-asset-materiality-risk.ipynb",
      "description": "Retrieve and compare a company's asset materiality score with climate metric scores. Visualize using histograms to compare distributions across the company and by asset type.",
      "api_credits": 981
    },
    {
      "id": "7",
      "title": "Company Asset Map",
      "filename": "7.company-asset-map.ipynb",
      "description": "Retrieve, view, and visualize a company's assets and their locations.",
      "api_credits": 589
    },
    {
      "id": "8",
      "title": "Company Competitor Comparison",
      "filename": "8.company-competitor-comparison.ipynb",
      "description": "Compare asset-level physical climate risks between a company and its competitor. Visualize geographic asset distributions, identify high-materiality assets, and distribution of climate risk across locations, asset types, and hazard types.",
      "api_credits": 983
    }
  ]
}
